common/models/User.php

SELECT * FROM `user` WHERE (`username`=3) AND (`role`=20)
---
    public static function isUserAdmin($username)
    {
      if (static::findOne(['username' => $username, 'role' => self::ROLE_KORSET1])){

SELECT * FROM `user` WHERE (`username`='1153080002') AND (`role`=40)
---
     public static function isUserSiswa($username)
    {
      if (static::findOne(['username' => $username, 'role' => self::ROLE_SISWA])){